In [1]:
import pandas as pd

In [7]:
a=[10,20,30,40,50]
x=pd.Series(a)
print(x)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [77]:
n={
    'name':['vinay','vijay','yogi'],
    'class':['c1','C4','C3'],
    'roll':[64,64,5]
}
df=pd.DataFrame(n)
print(df)

    name class  roll
0  vinay    c1    64
1  vijay    C4    64
2   yogi    C3     5

In [13]:
data=pd.read_csv("transactions.csv")

In [15]:
data.head()

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1

In [19]:
print(data.head)

<bound method NDFrame.head of    TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4>

In [21]:
data.info

<bound method DataFrame.info of    TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4>

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes

In [27]:
data.head(10)

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [31]:
data.describe()

       TransactionID    UserID  ProductID   Quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [39]:
print(data['UserID'])

0    7.0
1    3.0
2    3.0
3    1.0
4    2.0
5    2.0
6    3.0
7    NaN
8    7.0
9    3.0
Name: UserID, dtype: float64

In [47]:
data[['UserID','TransactionID','ProductID']]

   UserID  TransactionID  ProductID
0     7.0              1          2
1     3.0              2          4
2     3.0              3          3
3     1.0              4          2
4     2.0              5          4
5     2.0              6          5
6     3.0              7          4
7     NaN              8          2
8     7.0              9          4
9     3.0             10          4

In [53]:
data.iloc[1]

TransactionID               2
TransactionDate    2011-05-26
UserID                    3.0
ProductID                   4
Quantity                    1
Name: 1, dtype: object

In [59]:
df[df['roll']<64]

   name class  roll
2  yogi    C3     5

In [61]:
df[df['name']=='vinay']

    name class  roll
0  vinay    c1    64

In [67]:
df.rename(columns={'name':'Name'})

    Name class  roll
0  vinay    c1    64
1  vijay    C4    64
2   yogi    C3     5

In [73]:
data.isnull().sum()

TransactionID      0
TransactionDate    0
UserID             1
ProductID          0
Quantity           0
dtype: int64

In [103]:
z={
    'Name':['vinay','vijay','yogi'],
    'class':['c1','C4','C3'],
    'roll':[64,64,5],
    'Age':[22,21,22]
}
df2=pd.DataFrame(z)
df2.head()

    Name class  roll  Age
0  vinay    c1    64   22
1  vijay    C4    64   21
2   yogi    C3     5   22

In [105]:
df2.isnull().sum()

Name     0
class    0
roll     0
Age      0
dtype: int64